Repository: mpellegrin/wordpress-plugin-auto-image-attributes
Catalog: languages/*.po
Languages: fr

source: Image Attributes
fr: Attributs de l'image

source: Settings
fr: Paramètres

source: Auto Image Attributes For New Uploads
fr: Attributs automatiques pour les nouveaux Médias

source: General Settings
fr: Paramètres généraux

source: Filter Settings
fr: Paramètres du filtre

source: Automatically add Image attributes such as Image Title, Image Caption, Description And Alt Text from Image Filename.
fr: Ajoute automatiquement les attributs des images comme par exemple Titre, Légende, Description, Texte alternatif à partir du nom du fichier.

source: Set Image Title from filename
fr: Remplacer l'attribut Titre à partir du nom du fichier

source: Set Image Caption from filename
fr: Remplacer l'attribut Légende à partir du nom du fichier

source: Set Image Description from filename
fr: Remplacer l'attribut Description à partir du nom du fichier

source: Set Image Alt Text from filename
fr: Remplacer l'attribut Texte alternatif à partir du nom du fichier

source: Remove hyphens ( - ) from filename
fr: Supprimer les tirets ( - ) à partir du nom du fichier

source: Remove underscores ( _ ) from filename
fr: Supprimer les underscores ( _ ) à partir du nom du fichier

source: Save Settings
fr: Enregistrer les paramètres

source: Update Existing Images In Media Library
fr: Mettre à jour les images existantes dans la Bibliothèque de Médias

source: IMPORTANT: Please backup your database before running the bulk updater.
fr: IMPORTANT : Faites une sauvegarde de votre base de données avant de lancer le traitement en masse.

source: Run this bulk updater to update Image Title, Caption, Description and Alt Text from image filename for existing images in the media library.
fr: Lancer le traitement en masse pour changer les attributs Titre, Légende, et Texte alternatif à partir du nom du fichier pour les images présentes dans la Bibliothèque de Médias

source: If your image is named a-lot-like-love.jpg, your Image Title, Caption, Description and Alt Text will be: A Lot Like Love.
fr: Si votre image est nommée a-lot-like-love.jpg, le Titre, Légende, Description, et Texte alternatif seront : A Lot Like Love.

source: Be Patient and do not close the browser while it's running. In case you do, you can always resume by returning to this page later.
fr: Merci de patienter et de ne pas ferme r le navigateur lorsque le traitement est lancé. Si cela survient, vous pouvez reprendre le traitement en retournant sur cette page.

source: Run Bulk Updater
fr: Lancer le traitement en masse

source: To restart processing images from the beginning (the oldest upload first), reset the counter.
fr: Pour recommencer le traitement en masse du début (le plus ancien en premier), réinitialisez le compteur.

source: Reset Counter
fr: Réinitialiser le compteur

source: Number of Images Updated:
fr: Nombre d'images mises à jour :

source: Number of Images Remaining:
fr: Nombre d'images restantes :

source: Image Attributes Updated For Image:
fr: Attributs mis à jour pour l'image :

source: Counter reset. The bulk updater will start from scratch in the next run.
fr: Réinitialise le compteur. La mise à jour en masse recommencera du début au prochain lancement.
